Policies/Forrester Wave Demo/Route to JMS-Files/Create SOAP (lt)RetrieveAccountRequest(gt) message.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
   <soap12:Body>
       <ns:RetrieveAccountRequest xmlns:ns="http://www.axway.com/bank">
          <ns:id>${params.path.id}</ns:id>
      </ns:RetrieveAccountRequest>
   </soap12:Body>
</soap12:Envelope>
